#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
   # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-appbackend-app"
          + path                                      = "/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-developerportal-backend"
          + path                                      = "/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-fims-op-app"
          + path                                      = "/health"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-firmaconio-selfcare-backend"
          + path                                      = "/health"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-licences-ipatente-io-app"
          + path                                      = "/api/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-payments-ipatente-io-app"
          + path                                      = "/api/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-practices-ipatente-io-app"
          + path                                      = "/api/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-selfcare-io-app"
          + path                                      = "/api/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-session-manager-app"
          + path                                      = "/healthcheck"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-vehicles-ipatente-io-app"
          + path                                      = "/api/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = "api-app.internal.io.pagopa.it"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-apim"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = "io-p-itn-platform-api-gateway-apim-01.azure-api.net"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-platform-api-gateway"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/probes/probe-continua-app"
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-continua-app"
          + path                                      = "/info"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
            }
        }

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/backendAddressPools/continua-app-address-pool" -> null
          - backend_address_pool_name   = "continua-app-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/backendHttpSettingsCollection/continua-app-http-settings" -> null
          - backend_http_settings_name  = "continua-app-http-settings" -> null
          - http_listener_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/httpListeners/continua-io-pagopa-it-listener" -> null
          - http_listener_name          = "continua-io-pagopa-it-listener" -> null
          - id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/requestRoutingRules/continua-io-pagopa-it-reqs-routing-rule" -> null
          - name                        = "continua-io-pagopa-it-reqs-routing-rule" -> null
          - priority                    = 80 -> null
          - rewrite_rule_set_id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/rewriteRuleSets/rewrite-rule-set-continua" -> null
          - rewrite_rule_set_name       = "rewrite-rule-set-continua" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/backendAddressPools/continua-app-address-pool"
          + backend_address_pool_name  = "continua-app-address-pool"
          + backend_http_settings_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/backendHttpSettingsCollection/continua-app-http-settings"
          + backend_http_settings_name = "continua-app-http-settings"
          + http_listener_id           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/httpListeners/continua-io-pagopa-it-listener"
          + http_listener_name         = "continua-io-pagopa-it-listener"
          + id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/requestRoutingRules/continua-io-pagopa-it-reqs-routing-rule"
          + name                       = "continua-io-pagopa-it-reqs-routing-rule"
          + priority                   = 80
          + rewrite_rule_set_id        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/rewriteRuleSets/rewrite-rule-set-continua"
          + rewrite_rule_set_name      = "rewrite-rule-set-continua"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_http_settings_id    = (known after apply)
          + http_listener_id            = (known after apply)
          + http_listener_name          = "api-app-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "api-app-io-pagopa-it-reqs-routing-rule-by-path"
          + priority                    = 70
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "io-backend-path-based-rule-url-map"
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_http_settings_id    = (known after apply)
          + http_listener_id            = (known after apply)
          + http_listener_name          = "app-backend-io-italia-it-listener"
          + id                          = (known after apply)
          + name                        = "app-backend-io-italia-it-reqs-routing-rule-by-path"
          + priority                    = 40
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "io-backend-path-based-rule-url-map"
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "apim-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "apim-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "api-io-italia-it-listener"
          + id                          = (known after apply)
          + name                        = "api-io-italia-it-reqs-routing-rule"
          + priority                    = 30
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-api"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "apim-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "apim-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "api-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "api-io-pagopa-it-reqs-routing-rule"
          + priority                    = 50
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-api"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "apim-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "apim-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "api-mtls-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "api-mtls-io-pagopa-it-reqs-routing-rule"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-api-mtls"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "apim-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "apim-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "api-web-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "api-web-io-pagopa-it-reqs-routing-rule"
          + priority                    = 100
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-api-web"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "developerportal-backend-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "developerportal-backend-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "developerportal-backend-io-italia-it-listener"
          + id                          = (known after apply)
          + name                        = "developerportal-backend-io-italia-it-reqs-routing-rule"
          + priority                    = 20
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-developerportal-backend"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "fims-op-app-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "fims-op-app-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "oauth-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "oauth-io-pagopa-it-reqs-routing-rule"
          + priority                    = 120
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-fims-op-app"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "firmaconio-selfcare-backend-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "firmaconio-selfcare-backend-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "firmaconio-selfcare-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "firmaconio-selfcare-pagopa-it-reqs-routing-rule"
          + priority                    = 90
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-firmaconio-selfcare-backend"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "licences-ipatente-io-app-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "licences-ipatente-io-app-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "licences-ipatente-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "licences-ipatente-io-pagopa-it-reqs-routing-rule"
          + priority                    = 131
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-ipatente-io-app"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "payments-ipatente-io-app-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "payments-ipatente-io-app-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "payments-ipatente-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "payments-ipatente-io-pagopa-it-reqs-routing-rule"
          + priority                    = 132
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-ipatente-io-app"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "practices-ipatente-io-app-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "practices-ipatente-io-app-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "practices-ipatente-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "practices-ipatente-io-pagopa-it-reqs-routing-rule"
          + priority                    = 133
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-ipatente-io-app"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "selfcare-io-app-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "selfcare-io-app-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "selfcare-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "selfcare-io-pagopa-it-reqs-routing-rule"
          + priority                    = 110
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-selfcare-io"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "vehicles-ipatente-io-app-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "vehicles-ipatente-io-app-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "vehicles-ipatente-io-pagopa-it-listener"
          + id                          = (known after apply)
          + name                        = "vehicles-ipatente-io-pagopa-it-reqs-routing-rule"
          + priority                    = 130
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-ipatente-io-app"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01/rewriteRuleSets/rewrite-rule-set-continua"
          ~ name = "rewrite-rule-set-continua" -> "rewrite-rule-set-api"

          ~ rewrite_rule {
              ~ name          = "http-headers-continua" -> "http-headers-api"
                # (1 unchanged attribute hidden)

              ~ request_header_configuration {
                  ~ header_name  = "X-Forwarded-Host" -> "X-Client-Ip"
                  ~ header_value = "{var_host}" -> "{var_client_ip}"
                }
              ~ request_header_configuration {
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ header_name  = (sensitive value)
                  ~ header_value = "{var_client_ip}" -> "false"
                }

                # (1 unchanged block hidden)
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-api-mtls"

          + rewrite_rule {
              + name          = "http-headers-api-mtls"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = (sensitive value)
                  + header_value = "true"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-api-app"

          + rewrite_rule {
              + name          = "http-headers-api-app"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-api-app-rewrite-platform-legacy-root"

          + rewrite_rule {
              + name          = "http-headers-api-app"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
          + rewrite_rule {
              + name          = "rewrite-url-to-platform-legacy"
              + rule_sequence = 200

              + url {
                  + components = "path_only"
                  + path       = "/api/platform-legacy{var_uri_path}"
                  + reroute    = false
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-api-app-rewrite-platform-legacy"

          + rewrite_rule {
              + name          = "http-headers-api-app"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
          + rewrite_rule {
              + name          = "rewrite-url-to-api-platform-legacy"
              + rule_sequence = 100

              + condition {
                  + ignore_case = true
                  + negate      = false
                  + pattern     = "^/api/v1/(.*)$"
                  + variable    = "var_uri_path"
                }

              + url {
                  + components = "path_only"
                  + path       = "/api/platform-legacy/v1/{var_uri_path_1}"
                  + reroute    = false
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-api-app-rewrite-to-session-manager"

          + rewrite_rule {
              + name          = "http-headers-api-app"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
          + rewrite_rule {
              + name          = "rewrite-if-cookie-present"
              + rule_sequence = 200

              + condition {
                  + ignore_case = true
                  + negate      = false
                  + pattern     = "test-session-manager"
                  + variable    = "http_req_Cookie"
                }

              + url {
                  + components = "path_only"
                  + path       = "/session-manager{var_uri_path}"
                  + reroute    = true
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-api-app-remove-base-path-session-manager"

          + rewrite_rule {
              + name          = "http-headers-api-app"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
          + rewrite_rule {
              + name          = "strip_base_session_manager_path"
              + rule_sequence = 200

              + condition {
                  + ignore_case = true
                  + negate      = false
                  + pattern     = "/session-manager/(.*)"
                  + variable    = "var_uri_path"
                }

              + url {
                  + components = "path_only"
                  + path       = "/{var_uri_path_1}"
                  + reroute    = false
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-fims-op-app"

          + rewrite_rule {
              + name          = "http-headers-fims-op-app"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Host"
                  + header_value = "{var_host}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-api-web"

          + rewrite_rule {
              + name          = "http-headers-api-web"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-developerportal-backend"

          + rewrite_rule {
              + name          = "http-headers-developerportal-backend"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-firmaconio-selfcare-backend"

          + rewrite_rule {
              + name          = "http-headers-firmaconio-selfcare-backend"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-continua"

          + rewrite_rule {
              + name          = "http-headers-continua"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Host"
                  + header_value = "{var_host}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-selfcare-io"

          + rewrite_rule {
              + name          = "http-headers-selfcare-io"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }
      + rewrite_rule_set {
          + name = "rewrite-rule-set-ipatente-io-app"

          + rewrite_rule {
              + name          = "http-headers-fims-op-app"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Host"
                  + header_value = "{var_host}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_profile {
          + name                             = "io-p-itn-api-mtls-profile"
          + trusted_client_certificate_names = [
              + "io-issuer-chain",
            ]
          + verify_client_cert_issuer_dn     = true

          + ssl_policy {
              + cipher_suites        = [
                  + "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
                  + "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
                ]
              + disabled_protocols   = []
              + min_protocol_version = "TLSv1_2"
              + policy_type          = "Custom"
                # (1 unchanged attribute hidden)
            }
        }
      + ssl_profile {
          + name                         = "io-p-itn-ssl-profile"
          + verify_client_cert_issuer_dn = false

          + ssl_policy {
              + cipher_suites        = [
                  + "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
                  + "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
                ]
              + disabled_protocols   = []
              + min_protocol_version = "TLSv1_2"
              + policy_type          = "Custom"
                # (1 unchanged attribute hidden)
            }
        }

      + trusted_client_certificate {
          + data = (sensitive value)
          + name = "io-issuer-chain"
        }

      + url_path_map {
          + default_backend_address_pool_name  = "appbackend-app-address-pool"
          + default_backend_http_settings_name = "appbackend-app-http-settings"
          + default_rewrite_rule_set_name      = "rewrite-rule-set-api-app"
          + name                               = "io-backend-path-based-rule-url-map"

          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "acs"
              + paths                      = [
                  + "/assertionConsumerService",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "platform-api-gateway-address-pool"
              + backend_http_settings_name = "platform-api-gateway-http-settings"
              + name                       = "api-gateway-cdc"
              + paths                      = [
                  + "/api/cdc/*",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "platform-api-gateway-address-pool"
              + backend_http_settings_name = "platform-api-gateway-http-settings"
              + name                       = "api-gateway-platform-info"
              + paths                      = [
                  + "/info",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app-rewrite-platform-legacy-root"
            }
          + path_rule {
              + backend_address_pool_name  = "platform-api-gateway-address-pool"
              + backend_http_settings_name = "platform-api-gateway-http-settings"
              + name                       = "api-gateway-platform-ping"
              + paths                      = [
                  + "/api/v1/ping",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app-rewrite-platform-legacy"
            }
          + path_rule {
              + backend_address_pool_name  = "platform-api-gateway-address-pool"
              + backend_http_settings_name = "platform-api-gateway-http-settings"
              + name                       = "api-gateway-platform-status"
              + paths                      = [
                  + "/api/v1/status",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app-rewrite-platform-legacy"
            }
          + path_rule {
              + backend_address_pool_name  = "platform-api-gateway-address-pool"
              + backend_http_settings_name = "platform-api-gateway-http-settings"
              + name                       = "api-gateway-platform-trials"
              + paths                      = [
                  + "/api/v1/trials/*",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app-rewrite-platform-legacy"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "bpd-user"
              + paths                      = [
                  + "/bpd/api/v1/user",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "fast-login"
              + paths                      = [
                  + "/api/v1/fast-login",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "appbackend-app-address-pool"
              + backend_http_settings_name = "appbackend-app-http-settings"
              + name                       = "healthcheck"
              + paths                      = [
                  + "/healthcheck",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app-rewrite-to-session-manager"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "login"
              + paths                      = [
                  + "/login",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "logout"
              + paths                      = [
                  + "/logout",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "metadata"
              + paths                      = [
                  + "/metadata",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "nonce-fast-login"
              + paths                      = [
                  + "/api/v1/fast-login/nonce/generate",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "pagopa-user"
              + paths                      = [
                  + "/pagopa/api/v1/user",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "session"
              + paths                      = [
                  + "/api/v1/session",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "session-manager"
              + paths                      = [
                  + "/session-manager/*",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app-remove-base-path-session-manager"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "test-login"
              + paths                      = [
                  + "/test-login",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
          + path_rule {
              + backend_address_pool_name  = "session-manager-app-address-pool"
              + backend_http_settings_name = "session-manager-app-http-settings"
              + name                       = "zendesk-user"
              + paths                      = [
                  + "/api/backend/zendesk/v1/jwt",
                ]
              + rewrite_rule_set_name      = "rewrite-rule-set-api-app"
            }
        }

        # (8 unchanged blocks hidden)
    }

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.agw will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "agw" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-waf-01"
        name                = "io-p-itn-agw-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-api-app-waf-01"
        name                = "io-p-itn-agw-api-app-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.3"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
